---
kind: method
id: M:Autodesk.Revit.DB.DWFImportOptions.Dispose
source: html/33f1fd20-abe0-516d-d0a8-dce491479de4.htm
---
# Autodesk.Revit.DB.DWFImportOptions.Dispose Method

Releases all resources used by the DWFImportOptions

## Syntax (C#)
```csharp
public void Dispose()
```